podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ROM_MKE15Z7.svd.xml
<!--
Devices using this peripheral: 
      MKE14Z7
      MKE15Z7
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "ROM_MKE15Z7" ?>
         <name>ROM</name>
         <description>System ROM</description>
         <groupName>ROM</groupName>
         <headerStructName>ROM</headerStructName>
         <baseAddress>0xF0002000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFCC</offset>
            <size>0x34</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>3</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2</dimIndex>
               <name>ENTRY%s</name>
               <description>Entry</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>ENTRY</name>
                     <description>ENTRY</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TABLEMARK</name>
               <description>End of Table Marker Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MARK</name>
                     <description>MARK</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSACCESS</name>
               <description>System Access Register</description>
               <addressOffset>0xFCC</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>SYSACCESS</name>
                     <description>SYSACCESS</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>4,5,6,7,0,1,2,3</dimIndex>
               <name>PERIPHID%s</name>
               <description>Peripheral ID Register</description>
               <addressOffset>0xFD0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PERIPHID</name>
                     <description>PERIPHID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>COMPID%s</name>
               <description>Component ID Register</description>
               <addressOffset>0xFF0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>COMPID</name>
                     <description>Component ID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
